In [1]:
import warnings

warnings.filterwarnings("ignore") #just to keep clean
from configparser import ConfigParser
import mysql.connector as DB_connector
from simple_ddl_parser import DDLParser
import pprint
import six
import pandas as pd
import numpy as np

In [2]:
Creat_Table1="CREATE TABLE if not exists author(A_ID int NOT NULL, \
					a_name varchar(100), \
                    PRIMARY KEY (A_ID));"
Creat_Table2="CREATE TABLE if not exists books(B_ID int NOT NULL PRIMARY KEY, \
				   b_name varchar(100), \
                   Price int NOT NULL, \
                   A_ID int NOT NULL, \
                   FOREIGN KEY (A_ID) REFERENCES author(A_ID));"

## DDL parsing

In [3]:
table1_details=DDLParser(Creat_Table1).run()
table1=table1_details[0]['table_name']
print(table1)
pprint.pprint(table1_details)

author
[{'alter': {},
  'checks': [],
  'columns': [{'check': None,
               'default': None,
               'name': 'A_ID',
               'nullable': False,
               'references': None,
               'size': None,
               'type': 'int',
               'unique': False},
              {'check': None,
               'default': None,
               'name': 'a_name',
               'nullable': True,
               'references': None,
               'size': 100,
               'type': 'varchar',
               'unique': False}],
  'if_not_exists': True,
  'index': [],
  'partitioned_by': [],
  'primary_key': ['A_ID'],
  'schema': None,
  'table_name': 'author',
  'tablespace': None}]

In [4]:
table2_details=DDLParser(Creat_Table2).run()
table2=table2_details[0]['table_name']
print(table2)
pprint.pprint(table2_details)

books
[{'alter': {},
  'checks': [],
  'columns': [{'check': None,
               'default': None,
               'name': 'B_ID',
               'nullable': False,
               'references': None,
               'size': None,
               'type': 'int',
               'unique': False},
              {'check': None,
               'default': None,
               'name': 'b_name',
               'nullable': True,
               'references': None,
               'size': 100,
               'type': 'varchar',
               'unique': False},
              {'check': None,
               'default': None,
               'name': 'Price',
               'nullable': False,
               'references': None,
               'size': None,
               'type': 'int',
               'unique': False},
              {'check': None,
               'default': None,
               'name': 'A_ID',
               'nullable': False,
               'references': {'column': 'A_ID',
                              'deferrable_initially': None,
                              'on_delete': None,
                              'on_update': None,
                              'schema': None,
                              'table': 'author'},
               'size': None,
               'type': 'int',
               'unique': False}],
  'if_not_exists': True,
  'index': [],
  'partitioned_by': [],
  'primary_key': ['B_ID'],
  'schema': None,
  'table_name': 'books',
  'tablespace': None}]

## OOPS concepts applied

In [5]:
class Author:
    def __init__(self,name:str,a_id:int):
        if isinstance(name,six.string_types) and isinstance(a_id,six.integer_types):
            pass
        else:
            print(type(name))
            print(type(a_id))
            raise Exception("Name should be string and a_id should be integer")
        self.name=name
        self.a_id=a_id
    def __repr__(self):
        return f"The author's name is {self.name}, with id {self.a_id}"
    def __eq__(self,other):
        return str(self.name).lower() == str(other.name).lower() and self.a_id == other.a_id
    def author_details(self):
        print(f"_________{self.name} , {self.a_id}_______")
class Books(Author):
    def __init__(self,name,a_id,b_name:str,b_id:int,price:float):
        if isinstance(name,six.string_types) and isinstance(a_id,six.integer_types):
            pass
        else:
            print(type(name))
            print(type(a_id))
            raise Exception("Name should be string and a_id should be integer")
            
        if isinstance(b_name,six.string_types) and isinstance(b_id,six.integer_types) and isinstance(price,float):
            pass
        else:
            print(type(b_name))
            print(type(b_id))
            print(type(price))
            raise Exception("Name should be string,b_id should be integer and price shouldbe float")
        self.name=name
        self.a_id=a_id
        self.b_name=b_name
        self.b_id=b_id
        self.price=price
        self.author_details()
    def __repr__(self):
        return f"The Book's name is {self.b_name}, with id {self.a_id}, \
        by {self.name} with author id {self.a_id}  --- Price of book is {self.price}"
    def __eq__(self,other):
        return str(self.name).lower() == str(other.name).lower() and self.a_id == other.a_id

if __name__=="__main__":
    data=["Valmiki",1,"Ramayan",1,3258.50]
    
    book=Books(name=data[0],a_id=data[1],b_name=data[2],b_id=data[3],price=data[4])
    print(book)

_________Valmiki , 1_______
The Book's name is Ramayan, with id 1,         by Valmiki with author id 1  --- Price of book is 3258.5

## creating tables and populating data

In [6]:
df=pd.read_csv("Books_data.csv",index_col=0)

In [7]:
df.head()

,bookId,title,price,author,a_id
0,2767052-the-hunger-games,The Hunger Games,386.84,Suzanne Collins,3017
1,2.Harry_Potter_and_the_Order_of_the_Phoenix,Harry Potter and the Order of the Phoenix,560.88,"J.K. Rowling, Mary GrandPr√© (Illustrator)",8873
2,2657.To_Kill_a_Mockingbird,To Kill a Mockingbird,529.42,Harper Lee,6718
3,1885.Pride_and_Prejudice,Pride and Prejudice,529.42,"Jane Austen, Anna Quindlen (Introduction)",4117
4,41865.Twilight,Twilight,159.60,Stephenie Meyer,5008

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4938 entries, 0 to 4937
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   bookId  4938 non-null   object
 1   title   4938 non-null   object
 2   price   4938 non-null   float64
 3   author  4938 non-null   object
 4   a_id    4938 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 231.5+ KB

The bookId is in the form of string,just for the sake of this exercise,lut us transform the data into integer format. In order to normalize the data, let us break this into two tables and load the same into SQL tables.

In [9]:
df["b_id"]=df["bookId"].index

df.drop(columns=["bookId"],inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4938 entries, 0 to 4937
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   4938 non-null   object
 1   price   4938 non-null   float64
 2   author  4938 non-null   object
 3   a_id    4938 non-null   int64
 4   b_id    4938 non-null   int64
dtypes: float64(1), int64(2), object(2)
memory usage: 231.5+ KB

In [10]:
cols={"title":"b_name",
"price":"Price",
"author":"a_name",
"a_id":"A_ID",
"b_id":"B_ID"}
df.rename(columns=cols,inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4938 entries, 0 to 4937
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   b_name  4938 non-null   object
 1   Price   4938 non-null   float64
 2   a_name  4938 non-null   object
 3   A_ID    4938 non-null   int64
 4   B_ID    4938 non-null   int64
dtypes: float64(1), int64(2), object(2)
memory usage: 231.5+ KB

In [11]:
authors=df[["A_ID","a_name"]]
authors=authors.drop_duplicates()
authors.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2777 entries, 0 to 4937
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A_ID    2777 non-null   int64
 1   a_name  2777 non-null   object
dtypes: int64(1), object(1)
memory usage: 65.1+ KB

In [12]:
books=df[["B_ID","b_name","Price","A_ID"]]
books["b_name"]=books["b_name"].apply(lambda x:x[:99])
books=books.drop_duplicates()
books.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4938 entries, 0 to 4937
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   B_ID    4938 non-null   int64
 1   b_name  4938 non-null   object
 2   Price   4938 non-null   float64
 3   A_ID    4938 non-null   int64
dtypes: float64(1), int64(2), object(1)
memory usage: 192.9+ KB

In [13]:
db_config=ConfigParser()
db_config.read("db_connection.ini")

['db_connection.ini']

In [14]:
current_db=DB_connector.connect(
    host=db_config["SQL_CREDS"]["host"],
    user=db_config["SQL_CREDS"]["user"],
    password=db_config["SQL_CREDS"]["password"],
    database=db_config["SQL_CREDS"]["database"]
)
cursor=current_db.cursor()

In [15]:
cursor.execute(Creat_Table1)
cursor.execute(Creat_Table2)

In [16]:
cursor.execute("SHOW TABLES")

In [17]:
for t in cursor:
    print(t)

('author',)
('books',)

# loading csv data to SQL

In [18]:
authors["a_name"]=authors["a_name"].apply(lambda x:x[:99])
authors.head()

   A_ID                                     a_name
0  3017                            Suzanne Collins
1  8873  J.K. Rowling, Mary GrandPr√© (Illustrator)
2  6718                                 Harper Lee
3  4117  Jane Austen, Anna Quindlen (Introduction)
4  5008                            Stephenie Meyer

In [19]:
insert_table_1="INSERT INTO author (A_ID,a_name) VALUES (%s ,%s)"

cursor.executemany(insert_table_1,tuple(authors.to_numpy().tolist()))
current_db.commit()

In [20]:
insert_table_2="INSERT INTO books (B_ID,b_name,Price,A_ID) VALUES (%s ,%s ,%s ,%s)"

cursor.executemany(insert_table_2,tuple(books.to_numpy().tolist()))
current_db.commit()

## fetching data from SQL

In [21]:
see_table1="select * from author limit 5000"
see_table2="select * from books limit 5000"

In [22]:
result_authors=pd.DataFrame()
result_books=pd.DataFrame()

In [23]:
cursor.execute(see_table1)
result=cursor.fetchall()
result_authors=pd.DataFrame(data=result,columns=["author_id","author_name"])

cursor.execute(see_table2)
result=cursor.fetchall()
result_books=pd.DataFrame(data=result,columns=["book_id","book_name","book_price","author_ID"])

In [24]:
result_authors.head()

   author_id                                        author_name
0       3003  Alice Oseman (Goodreads Author), Aysha Kala (N...
1       3004                   James McBride (Goodreads Author)
2       3005               Elizabeth Gilbert (Goodreads Author)
3       3014                  Rachel Hartman (Goodreads Author)
4       3017                                    Suzanne Collins

In [25]:
result_books.head()

   book_id                                  book_name  book_price  author_ID
0        0                           The Hunger Games         387       3017
1        1  Harry Potter and the Order of the Phoenix         561       8873
2        2                      To Kill a Mockingbird         529       6718
3        3                        Pride and Prejudice         529       4117
4        4                                   Twilight         160       5008

In [26]:
result_authors.to_parquet("authors_data_result.pqt")
result_books.to_parquet("books_data_result.pqt")